@aareet With helm_debug = 1

```
$ helm_debug=1 tf apply
kubernetes_namespace.instana-agent: Refreshing state... [id=terraform-example-namespace]

An execution plan has been generated and is shown below.  
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.instana-agent will be created
  + resource "helm_release" "instana-agent" {
      + atomic                     = false
      + chart                      = "instana-agent"      
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "instana-agent"
      + namespace                  = "terraform-example-namespace"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = (known after apply)
      + wait                       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

helm_release.instana-agent: Creating...

Error: no cached repo found. (try 'helm repo update'): open C:\Users\ABHINA~1.KHA\AppData\Local\Temp\2\helm\repository\argo-index.yaml: The system cannot find the file specified.

  on sonarqube.tf line 1, in resource "helm_release" "instana-agent":
   1: resource "helm_release" "instana-agent" {

```